W7D2/MusicApp/app/views/albums/edit.html.erb

SELECT "bands".* FROM "bands"
---
  <select name="album[band_id]" id="album_band">
    <% Band.all.each do |band| %>