W7D2/MusicApp/app/views/albums/new.html.erb

  <select name="album[band_id]" id="album_band">
    <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"