W7D2/MusicApp/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "live", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Oink"], ["year", 1989], ["live", true], ["created_at", "2021-06-22 23:53:50.608499"], ["updated_at", "2021-06-22 23:53:50.608499"], ["band_id", 1]]
---
  def create
    @album = Album.new(album_params)
    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "live" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["live", false], ["updated_at", "2021-06-23 01:27:53.423460"], ["id", 1]]
---
  def update
    @album = Album.find(params[:id])
    if @album.update(album_params)