W6D5/Cats/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)
        if @cat.save!
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["birth_date", "2021-06-16"], ["color", "White"], ["name", "1"], ["sex", "M"], ["description", "aaa"], ["created_at", "2021-06-21 02:22:13.574724"], ["updated_at", "2021-06-21 02:22:13.574724"]]

    def update
        @cat = Cat.find(params[:id])
        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Garfield1"], ["description", "1"], ["updated_at", "2021-06-21 02:33:56.396998"], ["id", 1]]